In [5]:
import pandas as pd 
import numpy as np

In [6]:
df = pd.read_excel('D:\dataset\dataset2.xlsx')

In [7]:
df

  Category  Weather_V-1  Holiday_V-2  Game_V-3  Qty
0        A            5            1         0  250
1        B            3            1         1  200
2        C            1            1         0   75
3        D            4            1         1  400
4        E            4            0         0  150
5        F            2            0         0   50

In [5]:
import math 
dis = []
for i in range(6):
    dis.append(math.sqrt((float(df.iloc[i]['Weather V-1'])-1)**2
                         +(float(df.iloc[i]['Holiday V-2'])- 1)**2
                         +(float(df.iloc[i]['Game V-3'])-0)**2))

In [6]:
df['dis'] = dis
df

  Category  Weather V-1  Holiday V-2  Game V-3  Qty       dis
0        A            5            1         0  250  4.000000
1        B            3            1         1  200  2.236068
2        C            1            1         0   75  0.000000
3        D            4            1         1  400  3.162278
4        E            4            0         0  150  3.162278
5        F            2            0         0   50  1.414214

In [7]:
df.sort_values('dis')

  Category  Weather V-1  Holiday V-2  Game V-3  Qty       dis
2        C            1            1         0   75  0.000000
5        F            2            0         0   50  1.414214
1        B            3            1         1  200  2.236068
3        D            4            1         1  400  3.162278
4        E            4            0         0  150  3.162278
0        A            5            1         0  250  4.000000

In [9]:
df.sort_values('dis').head(4)

  Category  Weather V-1  Holiday V-2  Game V-3  Qty       dis
2        C            1            1         0   75  0.000000
5        F            2            0         0   50  1.414214
1        B            3            1         1  200  2.236068
3        D            4            1         1  400  3.162278

In [10]:
y = df.sort_values('dis').head(4)

In [11]:
z = y["Qty"]
z

2     75
5     50
1    200
3    400
Name: Qty, dtype: int64

In [12]:
np.mean(z)

181.25